## 19. 시계열 데이터3

### 주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과 2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오. 단 Events컬럼이 '1'인 경우 80%의 Salse값만 반영함 (최종값은 소수점 반올림 후 정수 출력)
- 데이터셋 : basic2.csv

In [48]:
import pandas as pd

df = pd.read_csv('../data/basic2.csv')
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [49]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [50]:
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month

In [51]:
### Events컬럼이 '1'인 경우 80%의 Salse값만 반영
def events(df):
    df['Sales'] = df['Sales'] * 0.8 if df['Events'] == 1 else df['Sales']
    return df

df = df.apply(lambda x: events(x), axis=1)
df.head()

        Date       Sales      PV      UV  Events  Year  Month
0 2022-01-01  18169220.0  397349  4421.0       1  2022      1
1 2022-01-02     36779.0    3969  2289.0       0  2022      1
2 2022-01-03  11155100.0  373890     NaN       1  2022      1
3 2022-01-04   8088593.0  142054  2157.0       0  2022      1
4 2022-01-05   2395374.0  190684     NaN       0  2022      1

In [52]:
year1 = df[df['Year']==2022]
year1['Events'].value_counts()

0    271
1     94
Name: Events, dtype: int64

In [60]:
# 2022년 월별 sales합계
sales_2022 = year1.groupby(year1['Month'])[['Sales']].sum()

sales_2022

             Sales
Month
1      114475247.2
2      153453688.6
3      172483809.4
4      111466880.8
5      121801396.0
6      165288258.4
7      197145878.0
8      108173602.2
9      157752502.6
10     183253174.0
11      89359502.2
12     191208107.8

In [56]:
sales_max_2022 = sales_2022['Sales'].max()
print(sales_max_2022)

197145878.0

In [57]:
year2 = df[df['Year']==2023]
year2['Events'].value_counts()

0    267
1     98
Name: Events, dtype: int64

In [61]:
# 2023년 월별 sales합계
sales_2023 = year2.groupby(year2['Month'])[['Sales']].sum()

sales_2023

             Sales
Month
1      183416542.6
2      163354661.6
3      198438634.6
4      112160979.0
5      143287169.2
6      133574075.4
7      131657675.4
8      131982344.2
9      219594547.6
10     155630473.2
11     239619313.8
12     139131255.4

In [62]:
sales_max_2023 = sales_2023['Sales'].max()
print(sales_max_2023)

239619313.8

In [63]:
print(abs(sales_max_2023-sales_max_2022))

42473435.80000001

In [64]:
print(round(abs(sales_max_2023-sales_max_2022)))

42473436